# Decision Tree

In [14]:
#import
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.tree import DecisionTreeClassifier

In [2]:
#read_csv
df=pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
#inforamtion
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   company                16 non-null     object
 1   job                    16 non-null     object
 2   degree                 16 non-null     object
 3   salary_more_then_100k  16 non-null     int64
dtypes: int64(1), object(3)
memory usage: 640.0+ bytes

In [4]:
inputs = df.drop("salary_more_then_100k",axis=1)
target=df['salary_more_then_100k']

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [10]:
#create label encoder
inputs['company_n']=LabelEncoder().fit_transform(inputs['company'])
inputs['job_n']=LabelEncoder().fit_transform(inputs['job'])
inputs['degree_n']=LabelEncoder().fit_transform(inputs['degree'])

In [12]:
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [13]:
#drop columns old replace it label
inputs_n=inputs.drop(['company','job','degree'],axis=1)
inputs_n.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [ ]:
##################

In [7]:
x=[60,50,50,50,40,40]
g,f,y='google','facebook','yahoo'
y=[g,g,f,f,y,g]
ss=pd.DataFrame({'age':x,
                'comp':y})
ss

   age      comp
0   60    google
1   50    google
2   50  facebook
3   50  facebook
4   40     yahoo
5   40    google

In [9]:
ss['company__label']=LabelEncoder().fit_transform(ss['comp'])
ss

   age      comp  company__label
0   60    google               1
1   50    google               1
2   50  facebook               0
3   50  facebook               0
4   40     yahoo               2
5   40    google               1

In [18]:
# object Decision Tree
model=DecisionTreeClassifier()

#fit data
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [20]:
#accuracy  model
#The result will be 1 because I used the same set of data
model.score(inputs_n,target)

1.0

In [22]:
#preict
model.predict([[2,0,1]])

C:\Users\DELL\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)